
## Plan Result




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sscs-servicebus-topic-namespace-name
  * azurerm_key_vault_secret.stub-servicebus-policy-name
  * azurerm_key_vault_secret.stub-servicebus-shared-access-key-tf
  * azurerm_key_vault_secret.stub-servicebus-subscription-name
  * azurerm_key_vault_secret.stub-servicebus-topic-name
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.sscs-servicebus-topic-namespace-name will be created
  + resource "azurerm_key_vault_secret" "sscs-servicebus-topic-namespace-name" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "sscs-servicebus-topic-namespace-name"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.stub-servicebus-policy-name will be created
  + resource "azurerm_key_vault_secret" "stub-servicebus-policy-name" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "stub-servicebus-policy-name"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.stub-servicebus-shared-access-key-tf will be created
  + resource "azurerm_key_vault_secret" "stub-servicebus-shared-access-key-tf" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "stub-servicebus-shared-access-key-tf"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.stub-servicebus-subscription-name will be created
  + resource "azurerm_key_vault_secret" "stub-servicebus-subscription-name" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "stub-servicebus-subscription-name"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.stub-servicebus-topic-name will be created
  + resource "azurerm_key_vault_secret" "stub-servicebus-topic-name" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
      + name           = "stub-servicebus-topic-name"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "stub-to-sscs-subscription-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/stub-hmc-to-cft-aat"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Vars":{}} -->